rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "awdwa"], ["rating", "G"], ["director", "aawd"], ["created_at", "2017-03-20 04:16:26.736838"], ["updated_at", "2017-03-20 04:16:26.736838"]]

  def find_similar_movies
    @movie = Movie.find(params[:id])
    director = @movie.director
    @similar_movies = Movie.where(:director =>  director)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]